name: "post_text_det_ver3"
backend: "python"
max_batch_size: 4
input [
{
    name: "SHAPE_LISTS"
    data_type: TYPE_FP32
    dims: [4]
},
{
    name: "OUTPUT_INFERS"
    data_type: TYPE_FP32
    dims: [1,-1,-1]
  }
]
 
output [
{
    name: "OUTPUT_DETS"
    data_type: TYPE_FP32
    dims: [4,2]
}
]

instance_group [{ kind: KIND_CPU }]
