name: "infer_text_det_ver3"
platform: "tensorrt_plan"
max_batch_size: 4
input [
{
    name: "x"
    data_type: TYPE_FP32
    dims: [3,-1,-1]
    
}
]
output[
{
    name: "sigmoid_0.tmp_0"
    data_type: TYPE_FP32
    dims: [1,-1,-1 ]
    
}
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]
